In [2]:
import pandas as pd

my_list = [10, 20, 30, 40, 50]

my_series = pd.Series(my_list)

print("List:")
print(my_list)
print("\nConverted Series:")
print(my_series)

List:
[10, 20, 30, 40, 50]

Converted Series:
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
date_series = pd.date_range(start='2021-05-01', end='2021-05-12')

for date in date_series:
    print(date.strftime('%Y-%m-%d'))

2021-05-01
2021-05-02
2021-05-03
2021-05-04
2021-05-05
2021-05-06
2021-05-07
2021-05-08
2021-05-09
2021-05-10
2021-05-11
2021-05-12

In [4]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [5]:
data = [
    ['Alice', 25, 'New York'],
    ['Bob', 30, 'Los Angeles'],
    ['Charlie', 35, 'Chicago']
]

df = pd.DataFrame(data, columns=['Name', 'Age', 'City'])
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [6]:
df = pd.read_csv('my_file.csv')
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [8]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Bob', 'Alice'],
    'Age': [25, 30, 35, 22, 25],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Chicago', 'Los Angeles']
}

df = pd.DataFrame(data)
print("Original DataFrame:")
df

Original DataFrame:

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3      Bob   22      Chicago
4    Alice   25  Los Angeles

In [9]:
sorted_df = df.sort_values(by=['Name', 'Age'], ascending=[True, False])
print("\nSorted DataFrame:")
sorted_df

Sorted DataFrame:

      Name  Age         City
0    Alice   25     New York
4    Alice   25  Los Angeles
1      Bob   30  Los Angeles
3      Bob   22      Chicago
2  Charlie   35      Chicago